{
	"servicesAndWorkflow.mainTitle": "Сервисы и рабочий процесс",
	"servicesAndWorkflow.about": "Здесь, в Buildups, мы руководствуемся возможностями и перспективами. Мы создаем лучшие проекты с нашим любопытством, опытом и возможностями.",
	"servicesAndWorkflow.services": "Сервисы",
	"servicesAndWorkflow.culture": "Культура",
	"servicesAndWorkflow.cultureAbout": "Наша культура основана на общем уважении к навыкам и взглядам каждого из нас, независимо от того, являетесь ли вы стажером или руководителем. Это культура, которая позволяет нам использовать наш уникальный опыт и опыт, чтобы бросать вызов друг другу, склоняться к тому, чтобы чувствовать себя некомфортно, а также переучиваться и переучиваться по мере того, как мы постоянно развиваемся. Вместе мы определяем ценности, за которые мы можем стоять и расти, поэтому все, что мы создаем, оказывает долгосрочное влияние к лучшему.",
	"servicesAndWorkflow.slogan": "Основа качественной работы – взаимоуважение внутри коллектива и по отношению к своим клиентам.",
	"servicesAndWorkflow.workflow": "Рабочий процесс",
	"servicesAndWorkflow.workflow1": "Наше путешествие начинается с исследования, в ходе которого мы изучаем и анализируем ваши бизнес-цели, болевые точки целевой аудитории и актуальные рыночные тенденции. Если у вас уже есть устаревший продукт, мы продолжим этот этап с аудитом. Свежий взгляд со стороны позволяет выявить основные точки улучшения и получить ценную информацию о будущем внешнем виде вашего нового продукта. Наш аудит комплексный - мы рассматриваем как дизайнерскую, так и техническую стороны.",
	"servicesAndWorkflow.workflow2": "Понимание и идеи, полученные на этапе исследования и аудита, воплощаются в жизнь, когда мы создаем концепцию дизайна и разрабатываем техническое подтверждение концепции. Концепция дизайна — это визуальное представление того, как ваш продукт должен выглядеть и вести себя. Концепция дизайна проверяется посредством проверки концепции — небольшой части  ункциональности, разработанной для подтверждения того, что наши идеи осуществимы с технической точки зрения.",
	"servicesAndWorkflow.workflow3": "Этап начинается со всех знаний, которые мы получили на этапе концепции и проверки. Мы уже достаточно знаем о продукте (что строить) и проекте (как строить). Мы разрабатываем и проектируем продукт спринт за спринтом, итеративно продвигаясь к моменту запуска MVP.",
	"servicesAndWorkflow.workflow4": "На этом итерации не заканчиваются — мы продолжаем работать над продуктом после запуска — дорабатываем существующие фичи, добавляем новый функционал, работаем над надежностью системы.",
	"servicesAndWorkflow.title": "Мы ищем таланты",
	"servicesAndWorkflow.more": "Узнать больше",
	"servicesAndWorkflow.subTitle": "Стань частью нашей сильной команды.",
  "servicesAndWorkflow.circle1Title": "Исследование задач",
  "servicesAndWorkflow.circle2Title": "Концепция",
  "servicesAndWorkflow.circle3Title": "Создание",
  "servicesAndWorkflow.circle4Title": "Запуск"
}
