{
  "portfolio.subTitle": "Build apps - Portfolio",
  "portfolio.mainTitle": "Portfolio",
  "portfolio.goBack": "Go back to portfolio",
  "portfolio.about": "BuildApps is an actively developing IT company that provides a wide range of high quality products, solutions and services in the field of information technology. The main areas of our activity are the development of Internet projects of various levels of complexity, the creation of business automation systems and IT consulting.",
  "portfolio.leadSoftTitle": "Lead management software",
  "portfolio.leadDesc": "A CRM that covers most of the organization's processes related to business lending. A full cycle of processing an application - from the moment of an obtaining to the issuance of a loan. Integration with third-party services to obtain more complete information about the loan - credit history, information from registries for legal entities or individuals.",
  "portfolio.leadFullDesc": "Due to the high competition in the lending market and the high demand for loans for business purposes, the speed and the quality of working with clients are much appreciated, and, last but not least, the automation of work with each application. This is where software in the form of CRM comes into play.",
  "portfolio.leadSoftPage": {
    "optimization": "Optimization of the registration of applications for the financial platform, which increased the number of clients by 30%",
    "optimizationDesc": "Even if your product is unique, the offer is profitable, and the working conditions are impeccable, you risk losing customers anyway. The key reasons are a weak technical base, services that do not fulfill their tasks, and outdated solutions. Our company helped PapaFinance, an online loan service, in this situation.",
    "papaFinance": "PapaFinance: the challenges of digitalization of financial services that we had to solve.",
    "papaFinanceDesc": "PapaFinance is an innovative financial platform that provides online financing for small businesses and loans up to 3 million rubles. After launching the platform and analyzing business processes, analysts found that procedures of submitting and processing applications are not efficient. Due to this problem, customers leave at the registration stage, which means that specialists in online loans cannot even get the user's contacts for the successful sale of products over the phone or online. The company's management approached BuildApps to optimize the customer journey and refine the loan platform to improve user experience. After all, the BuildApps portfolio already included similar projects, and customers were always satisfied with the studio's work, which is vital for companies in the digital environment.",
    "understanding": "Understanding business problems means understanding the main tasks",
    "understandingDesc": "To solve the main problem of PapaFinance, BuildApps specialists analyzed the functioning of the platform and algorithms for generating and processing applications, as a result of which they formed a key list of tasks:",
    "understandingLi1": "Simplifying registration of applications for different types of loans and financing through the service.",
    "understandingLi2": "Reducing the time for processing an application: from the platform's side and in the context of simplifying the routine for managers of a financial company.",
    "understandingLi3": "Monitoring the customer journey to successfully obtaining a loan.",
    "understandingLi4": "Automation of obtaining information about the counterparty and its financial reliability when deciding to issue a loan.",
    "understandingLi5": "Development of an algorithm for a comprehensive analysis of the customer's solvency.",
    "understandingLi6": "Separation of powers of company employees in the system and the creation of a single space for working with clients.",
    "understandingFooter": "When the specialists began immersing themselves in the business tasks of a financial company, the leadership of PapaFinance decided to attract more specialists. After all, BuildApps, even at the first stage of interaction, was able to show professionalism and a responsible attitude to the project, which really convinced the customer of the reliability and conscientiousness of this contractor. So, the project team has grown from one developer to 6 people: 4 developers, one technical analyst, and one QA engineer.",
    "work": "Tasks that flow into technical work",
    "workDesc": "The project infrastructure consisted of the server, architecture, and functional interface based on C#, ASP.NET Core, JS, TS, React, MongoDb, PostgreSql, Docker, and Docker compose technologies. Also, the customer required integration with the databases of government agencies, the National Bureau of Credit Histories, and open financial sources. Based on the tasks and technical constraints, BuildApps specialists compiled a detailed list of works for the successful closure of the project:",
    "workLi1": "When created in the system, the application goes through several stages, including verification by the verifier, underwriter, credit committee, etc. It is important to note that there can be any number of such checks, until all the necessary data is received.",
    "workLi2": "Configuring continuous integration and service health to support data updating.",
    "workLi3": "Development of methods to scale the product depending on the load, customer needs, and business requirements.",
    "workLi4": "Strengthening the resilience and fault tolerance of the platform.",
    "workLi5": "Creation of roles, separation of rights, powers, and access in the system.",
    "workLi6": "Implementation of additional modules and interfaces for integration with new business partners.",
    "workDesc2": "But, since the service was created by other specialists, the BuildApps developers faced several difficulties and challenges.",
    "workDesc3": "To quickly and efficiently manage the platform's architecture, it was necessary to understand the structure of services and algorithms. It requires an analysis of the technical documentation, which the past performers did not transfer to the client. As a result, the BuildApps developers had to figure out the architecture, code elements, and system dependencies on their own, which significantly extended the project closure period. Despite this, the team completed a huge list of tasks under a tight deadline.",
    "result": "Works that show the result:",
    "innovate": "BuildApps specialists have performed:",
    "performed": {
      "step1": "Transferring the service to a more convenient and customizable environment: initially, in the process of scaling — to a virtual server; after completion — to the client's local server.",
      "step2": "Building a micro-service and micro-front-end architecture, which made it possible to manage individual modules of the system more flexibly.",
      "step3": "Creation of a technical base, environment, and setting up processes for automatic testing of new modules and system algorithms.",
      "step4": "Adding an integration system and automatic uploading of information from available databases and registries about customers to optimize the costs of assessing their solvency.",
      "step5": "Separation of the roles of the financial company's employees in the system to obtain a clearer and more understandable distribution of powers and work with the client.",
      "step6": "Development of an automatic system for testing the platform's performance, identifying and recording information about failures and errors.",
      "step7": "TCreation of a model for integration with partner services.",
      "step8": "Consolidation of all technical details on the platform into updated, detailed, and understandable documentation."
    },
    "results": "Really noticeable results",
    "resultsDesc": "As a result of the comprehensive approach of BuildApps specialists to solving business problems of a financial company, the service has become simpler, clearer, and more productive. All applications are processed faster, and employees can automate and monitor loans. The quality of customer processing has also improved: thanks to clear and understandable information from up-to-date registers, the percentage of bad loans has decreased, which has increased the company's profitability. But the main thing is that thanks to integration with services for attracting potential customers and expanding the product line, the main goal has been achieved: an increase in the number of borrowers by more than 30%.",
    "resultsDesc2": "Such productive and systematic work for 12 months by the BuildApps team really impressed the PapaFinance management, and now the company plans to expand the roles of employees in the company, integrate the service with other platforms and marketplaces, and form new financial products.",
    "question": "Do you want to get the same tangible result in your project? Contact our manager to discuss the details right now!"
  },
  "portfolio.sushiTitle": "SUSHI SHOP",
  "portfolio.sushiDesc": "Online service for ordering sushi. The SushiShop system automatically determines your geolocation for the nearest sushi store to make the delivery time more comfortable for the user. The system also provides a bonus program, an accumulative system and various discounts for different holidays or seasons.",
  "portfolio.sushiFullDesc": "Today a mobile application for delivery is the most effective, least expensive, and relevant way to attract new customers, increase their level of loyalty, and receive real feedback. As well as increasing sales and profits.",
  "portfolio.sushiPage": {
    "section1": "Building and scaling business processes of the FoodTech online service that increased the flow of customers by 25%",
    "section1Desc": "Establishing business processes from scratch is always difficult, especially when it comes to such a demanding area as FoodTech. Founders of online services are faced with a serious task: to organize and automate all stages of orders and provide a unique user experience. We helped SushiShop, a mobile app for food delivery, to solve this problem. Our team took part in the initial stages of its development and the first release versions.",
    "section2": "SushiShop: the problems of organizing and scaling FoodTech processes that we needed to solve",
    "section2Desc1": "SushiShop is a mobile application for ordering Japanese dishes. The idea is to make the app automatically recognize the distance from the user to the nearest store and personalize the services. However, already at the initial stages of the implementation of the idea, the customer's team faced many problems associated with the low speed of processing orders, the lack of delivery monitoring tools, non-unique functionality, and integration difficulties.",
    "section2Desc2": "After a couple of unsuccessful attempts to optimize the processes on their own, the SushiShop management turned to the IT specialists of BuildApps. The client was convinced of our professionalism earlier while working on another project. Now we were required not only to create a technical base but also to implement custom features for the successful promotion of the platform. And it was necessary to do this in a short time, in 4 months.",
    "section3": "A set of tasks that we had to complete",
    "section3Desc": "In the process of setting goals, BuildApps specialists focused on key business goals and company’s individual requirements. As a result, we formed the following list of priority tasks:",
    "tasks": {
      "li1": "Reducing the time for processing applications at the level of both the platform and the sales department.",
      "li2": "Organization of logistics processes and increasing the accuracy of geolocation.",
      "li3": "Integration with monitoring systems for step-by-step tracking of the customer's path and order delivery.",
      "li4": "Improving the user experience when choosing foods, meals, drinks, and placing an order.",
      "li5": "Implementation of a bonus loyalty program to expand the customer base and attract traffic.",
      "li6": "Development of a buyer's personal account to store the history of interactions with the app."
    },
    "team": "After agreeing on the terms of reference with the management of SushiShop, it was decided to expand the IT team to achieve the set results in a short time. Several IT specialists were additionally involved in the work, including from the partner company, Notissimus. As a result, the team grew from two (developer and technical analyst) to 6 performers (4 developers, analyst, tester, and marketer).",
    "section4": "How we organized the workflow and eliminated pitfalls",
    "section4Desc": "The work was organized in accordance with Scrum algorithms. The process consisted of equal intervals of time, and after each of them, the app was tested with a specific set of functions. We chose this methodology for a simple reason: it ideally suited the requirements of the client and the project. SushiShop management was interested in taking part in the development from the very beginning: to have stable builds step by step, track progress, and receive reports on each completed task.",
    "section5": "The use of flexible methodology allowed us to:",
    "metodology": {
      "li1": "ensure transparency of cooperation by providing the customer with access to intermediate results;",
      "li2": "ensure transparency of cooperation by providing the customer with access to intermediate results;",
      "li3": "ensure transparency of cooperation by providing the customer with access to intermediate results;",
      "li4": "ensure transparency of cooperation by providing the customer with access to intermediate results;"
    },
    "planning": "So, thanks to flexible scrum planning and adherence to the best programming practices, we increased the efficiency of completing tasks with minimal investment and resources. It led to the creation of the release version of the app after 4 months.",
    "goals": "What steps we took to achieve the key goals.",
    "completed": "The BuildApps team completed:",
    "completedList": {
      "li1": "Building CI/CD processes to speed up the feedback loop and reduce the financial burden on the customer.",
      "li2": "Coding of screens for Android and IOS to create a base for promoting the service in top app stores.",
      "li3": "Adding the Cart and Customer Profile modules to expand the possibilities of using the service.",
      "li4": "Creation of a loyalty program with the ability to collect bonus points, focused on active orders, to motivate purchases.",
      "li5": "Setting up sending notifications to the client's email after placing an order to ensure the transparency of the service.",
      "li6": "Automation of obtaining data about the user's location to calculate the optimal delivery time for the goods selected by them.",
      "li7": "Development of a detailed catalog of products with an indication of the composition and calorie content to customize the selection of goods."
    },
    "section6": "Sustainable improvements that we managed to achieve in 4 months",
    "paragraphs": {
      "1": "As a result of the consistent work of a team of 6 professionals on the project, a number of unique ideas, both technical and marketing, were implemented.",
      "2": "Among our achievements appreciated by users of the release version: an intuitive interface, convenient search and selection functions, a script that encourages active purchases, and a high response rate to requests.",
      "3": "For business users of SushiShop, the most useful achievements are: flexible internal mechanisms that allow updating the interface and introducing new functions, constant product support, and reduced response time to problems by setting up logging.",
      "4": "Taken together, it gave impressive results: an increase in the flow of customers by more than 25%, an expansion of the sales geography, and an increase in network awareness, thanks to receiving positive reviews in marketplaces.",
      "5": "* Our team took part in the initial stages of development and the first release versions together with the company",
      "team": "As a result of the consistent work of a team of 6 professionals on the project, a number of unique ideas, both technical and marketing, were implemented."
      },
    "question": "Dreaming of your own FoodTech project? Do you want to get tangible results without unnecessary investments? Contact BuildApps to discuss the details of cooperation!"
  },
  "portfolio.estateTitle": "Petersburg real estate",
  "portfolio.estateDesc": "Mobile client for finding an apartment in residential complex in St. Petersburg and Moscow. The system allows you to book apartments, make pre-orders and find apartments at competitive prices",
  "portfolio.estateFullDesc": "Hundreds of people regularly search for apartments, conclude lease agreements with realtors, buy new properties or sell old ones. The growing demand and the accelerated pace of life leave people with less and less time to personally solve such problems. Who would be asked more often for help in these matters? To someone who can solve them not only qualitatively, but also faster than others. A real estate mobile app will give your business a competitive advantage. AgentPN is a professional application only for real estate agencies - partners of Petersburg Real Estate. Search and booking of apartments in the largest database of new buildings in St. Petersburg and the Leningrad region. A login to the application is by a phone number. Use your favorite work tool wherever you are. Conduct consultations remotely in a place convenient for the client. Access to apartments, mortgage calculator, apartment reservations, as well as a convenient database of your clients - in one application.",
  "portfolio.estatePage": {
    "interface": "- Simple and intuitive interface - fast movement between tabs and easy interaction;",
    "search": "- Convenient search filters - selection by specified parameters;",
    "location": "- Search on the map - demonstration of the object in relation to the location;",
    "data": "- Actual apartmentography - data on the availability of apartments and current prices online;",
    "database": "- Major developers - access to the exclusive database of Petersburg Real Estate, including Setl City facilities;",
    "layouts": "- Detailed layouts - the layout of the apartment specifying parameters;",
    "booking": "- Online booking in the application - send requests instantly and do not lose customers;",
    "presentation": "- Presentations for clients - the formation of a commercial proposal and sending to the client It is easy to sell more with Petersburg Real Estate. Join a team of leaders, offer the best for your clients, surprise them with your efficiency and competence. AgentPN is your mobile sales tool;",
    "team": "* Our team took part in the initial stages of development and the first release versions together with the company Notissimus"
  },
  "portfolio.askodTitle": "ASKOD Online",
  "portfolio.askodDesc": "ASKOD Online service a is designed to automate the processes of document circulation between legal entities and individuals and provides review, approval, signing, sending, receiving and storing documents in a cloud environment",
  "portfolio.askodFullDesc": "Askod is an online electronic document management system that allows you to organize work with electronic documents (creation, modification, search), as well as interaction between employees (transfer of documents, issuing tasks, sending notifications, etc.). Also, such a system is called EDMS (Electronic Document Management Systems).",
  "portfolio.tablePrice": "Price",
  "portfolio.tableTime": "Time estimate",
  "portfolio.askodPage": {
    "advantages": "Advantages",
    "advantagesDesc": "Transparency of business processes. Due to the system can monitor all the steps in the organization. Business processes become completely transparent for management and they are easier to control.",
    "discipline": "Higher performing discipline",
    "disciplineDesc": "According to statistics, 20% of the tasks received are not performed by the employees responsible for them. With full control over all stages of work, the ECM system directly affects the performance discipline of employees.",
    "cost": "Lower labor costs for managers and employees",
    "costDesc": "The system reduces the time that employees spend on almost all routine operations with documents: creation, search, approval, etc. Document flow is accelerated. And as a result, all processes in the organization go through faster.",
    "confidential": "Confidentiality of information is ensured",
    "confidentialDesc": "A data breach can cause millions in losses to an organization. Unlike traditional 'paper' workflow, the ECM system provides access to documents strictly in accordance with the assigned user rights. All actions on the document (reading, changing, signing) are recorded.",
    "ISO": "The requirements of ISO 9000 standards are met",
    "ISODesc": "The setting of quality management has now become one of the priority tasks in Russian companies. Among the requirements for the quality management system (QMS) there is a transparently delivered workflow, as well as information interaction between employees.",
    "innovate": "Easily to innovate and to teach beginners",
    "innovateDesc": "Thanks to the notification system, built on the basis of the ECM system, you can quickly bring the new rules of work to all employees. The training time for new employees is reduced by quickly searching for the necessary information (regulations, instructions, etc.). The routes and templates of documents are easily changed, after which the employees automatically start working in a new way.",
    "competition": "More competitive advantages",
    "competitionDesc": "The setting of quality management has now become one of the priority tasks in Russian companies. Among the requirements for the quality management system (QMS) there is a transparently delivered workflow, as well as information interaction between employees."
  }
}
