{
	"servicesAndWorkflow.mainTitle": "Сервіси та робочий процес",
	"servicesAndWorkflow.about": "Тут, у Buildups, нами керують можливості та перспективи. Ми створюємо найкращі проекти з нашою цікавістю, досвідом та можливостями.",
	"servicesAndWorkflow.services": "Сервіси",
	"servicesAndWorkflow.culture": "Культура",
	"servicesAndWorkflow.cultureAbout": "Наша культура заснована на спільній повазі до навичок і перспектив, які приносить кожен з нас, незалежно від того, чи є ви стажером чи керівником. Це культура, яка дозволяє нам використовувати наше унікальне походження та досвід, щоб кинути виклик один одному, схилятися до незручності, а також відучуватися й перевчитися, оскільки ми постійно розвиваємося. Разом ми визначаємо цінності, за якими ми можемо стояти та розвиватися, тому все, що ми створюємо, залишає тривалий вплив на краще.",
	"servicesAndWorkflow.slogan": "Основа якісної роботи – взаємоповага всередині колективу та по відношенню до клієнтів.",
	"servicesAndWorkflow.workflow": "робочий процес",
	"servicesAndWorkflow.workflow1": "Наша подорож починається з дослідження, під час якого ми вивчаємо та аналізуємо ваші бізнес-мети, больові точки цільової аудиторії та актуальні ринкові тенденції. Якщо у вас є застарілий продукт, ми продовжимо цей етап з аудитом. Свіжий погляд з боку дозволяє виявити основні точки покращення та отримати цінну інформацію про майбутній зовнішній вигляд вашого нового продукту. Наш аудит комплексний – ми розглядаємо як дизайнерську, так і технічну сторони.",
	"servicesAndWorkflow.workflow2": "Розуміння та ідеї, отримані на етапі дослідження та аудиту, втілюються у життя, коли ми створюємо концепцію дизайну та розробляємо технічне підтвердження концепції. Концепція дизайну — це візуальне уявлення про те, як ваш продукт має виглядати і поводитися. Концепція дизайну перевіряється за допомогою перевірки концепції — невеликої частини ункціональності, розробленої для підтвердження того, що наші ідеї можна здійснити з технічного погляду.",
	"servicesAndWorkflow.workflow3": "На цьому ітерації не закінчуються – ми продовжуємо працювати над продуктом після запуску – доопрацьовуємо існуючі фічі, додаємо новий функціонал, працюємо над надійністю системи.",
	"servicesAndWorkflow.workflow4": "На цьому ітерації не закінчуються – ми продовжуємо працювати над продуктом після запуску – доопрацьовуємо існуючі фічі, додаємо новий функціонал, працюємо над надійністю системи.",
	"servicesAndWorkflow.title": "Ми шукаємо таланти",
	"servicesAndWorkflow.more": "Детальніше",
	"servicesAndWorkflow.subTitle": "Будь частиною нашої міцної команди.",
  "servicesAndWorkflow.circle1Title": "Дослідження задач",
  "servicesAndWorkflow.circle2Title": "Концепція",
  "servicesAndWorkflow.circle3Title": "Розробка",
  "servicesAndWorkflow.circle4Title": "Запуск"
}
